Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/fcr.h
/* -------- FCR_STATUS : (FCR Offset: 0x14) ( R/ 32) NVM Status Register -------- */
#define FCR_STATUS_RESETVALUE                 _UINT32_(0x80000000)                                 /*  (FCR_STATUS) NVM Status Register  Reset Value */

#define FCR_STATUS_PRM_Pos                    _UINT32_(0)                                          /* (FCR_STATUS) NVM Power Reduction Mode Status Position */
#define FCR_STATUS_PRM_Msk                    (_UINT32_(0x1) << FCR_STATUS_PRM_Pos)                /* (FCR_STATUS) NVM Power Reduction Mode Status Mask */
#define FCR_STATUS_PRM(value)                 (FCR_STATUS_PRM_Msk & (_UINT32_(value) << FCR_STATUS_PRM_Pos)) /* Assigment of value for PRM in the FCR_STATUS register */
#define FCR_STATUS_TEMP_Pos                   _UINT32_(1)                                          /* (FCR_STATUS) NVM Operating Temperature Read Mode Status Position */
#define FCR_STATUS_TEMP_Msk                   (_UINT32_(0x1) << FCR_STATUS_TEMP_Pos)               /* (FCR_STATUS) NVM Operating Temperature Read Mode Status Mask */
#define FCR_STATUS_TEMP(value)                (FCR_STATUS_TEMP_Msk & (_UINT32_(value) << FCR_STATUS_TEMP_Pos)) /* Assigment of value for TEMP in the FCR_STATUS register */
#define FCR_STATUS_Msk                        _UINT32_(0x00000003)                                 /* (FCR_STATUS) Register Mask  */


/* -------- FCR_DBGCTRL : (FCR Offset: 0x18) (R/W 32) Debug Control Register -------- */
#define FCR_DBGCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_DBGCTRL) Debug Control Register  Reset Value */

#define FCR_DBGCTRL_CRCRUN_Pos                _UINT32_(0)                                          /* (FCR_DBGCTRL) CRC Debug Run Position */
#define FCR_DBGCTRL_CRCRUN_Msk                (_UINT32_(0x1) << FCR_DBGCTRL_CRCRUN_Pos)            /* (FCR_DBGCTRL) CRC Debug Run Mask */
#define FCR_DBGCTRL_CRCRUN(value)             (FCR_DBGCTRL_CRCRUN_Msk & (_UINT32_(value) << FCR_DBGCTRL_CRCRUN_Pos)) /* Assigment of value for CRCRUN in the FCR_DBGCTRL register */
#define FCR_DBGCTRL_DBGECC_Pos                _UINT32_(1)                                          /* (FCR_DBGCTRL) Debug ECC Mode Position */
#define FCR_DBGCTRL_DBGECC_Msk                (_UINT32_(0x3) << FCR_DBGCTRL_DBGECC_Pos)            /* (FCR_DBGCTRL) Debug ECC Mode Mask */
#define FCR_DBGCTRL_DBGECC(value)             (FCR_DBGCTRL_DBGECC_Msk & (_UINT32_(value) << FCR_DBGCTRL_DBGECC_Pos)) /* Assigment of value for DBGECC in the FCR_DBGCTRL register */
#define FCR_DBGCTRL_Msk                       _UINT32_(0x00000007)                                 /* (FCR_DBGCTRL) Register Mask  */


/* -------- FCR_ECCCTRL : (FCR Offset: 0x1C) (R/W 32) ECC Control Register -------- */
#define FCR_ECCCTRL_RESETVALUE                _UINT32_(0x40)                                       /*  (FCR_ECCCTRL) ECC Control Register  Reset Value */

#define FCR_ECCCTRL_ECCCTL_Pos                _UINT32_(4)                                          /* (FCR_ECCCTRL) NVM ECC Mode Control- restricts one or more NVMOPs Position */
#define FCR_ECCCTRL_ECCCTL_Msk                (_UINT32_(0x3) << FCR_ECCCTRL_ECCCTL_Pos)            /* (FCR_ECCCTRL) NVM ECC Mode Control- restricts one or more NVMOPs Mask */
#define FCR_ECCCTRL_ECCCTL(value)             (FCR_ECCCTRL_ECCCTL_Msk & (_UINT32_(value) << FCR_ECCCTRL_ECCCTL_Pos)) /* Assigment of value for ECCCTL in the FCR_ECCCTRL register */
#define FCR_ECCCTRL_ECCUNLCK_Pos              _UINT32_(6)                                          /* (FCR_ECCCTRL) NVM ECC Mode Control Unlock Position */
#define FCR_ECCCTRL_ECCUNLCK_Msk              (_UINT32_(0x1) << FCR_ECCCTRL_ECCUNLCK_Pos)          /* (FCR_ECCCTRL) NVM ECC Mode Control Unlock Mask */
#define FCR_ECCCTRL_ECCUNLCK(value)           (FCR_ECCCTRL_ECCUNLCK_Msk & (_UINT32_(value) << FCR_ECCCTRL_ECCUNLCK_Pos)) /* Assigment of value for ECCUNLCK in the FCR_ECCCTRL register */
#define FCR_ECCCTRL_SECCNT_Pos                _UINT32_(8)                                          /* (FCR_ECCCTRL) Flash SEC Count Position */
#define FCR_ECCCTRL_SECCNT_Msk                (_UINT32_(0xFF) << FCR_ECCCTRL_SECCNT_Pos)           /* (FCR_ECCCTRL) Flash SEC Count Mask */
#define FCR_ECCCTRL_SECCNT(value)             (FCR_ECCCTRL_SECCNT_Msk & (_UINT32_(value) << FCR_ECCCTRL_SECCNT_Pos)) /* Assigment of value for SECCNT in the FCR_ECCCTRL register */
#define FCR_ECCCTRL_Msk                       _UINT32_(0x0000FF70)                                 /* (FCR_ECCCTRL) Register Mask  */


/* -------- FCR_CRCCTRL : (FCR Offset: 0x20) (R/W 32) CRC Control Register -------- */
#define FCR_CRCCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCCTRL) CRC Control Register  Reset Value */

#define FCR_CRCCTRL_CRCRST_Pos                _UINT32_(0)                                          /* (FCR_CRCCTRL) CRC Reset Position */
#define FCR_CRCCTRL_CRCRST_Msk                (_UINT32_(0x1) << FCR_CRCCTRL_CRCRST_Pos)            /* (FCR_CRCCTRL) CRC Reset Mask */
#define FCR_CRCCTRL_CRCRST(value)             (FCR_CRCCTRL_CRCRST_Msk & (_UINT32_(value) << FCR_CRCCTRL_CRCRST_Pos)) /* Assigment of value for CRCRST in the FCR_CRCCTRL register */
#define FCR_CRCCTRL_CRCEN_Pos                 _UINT32_(1)                                          /* (FCR_CRCCTRL) Start CRC Calculation Position */
#define FCR_CRCCTRL_CRCEN_Msk                 (_UINT32_(0x1) << FCR_CRCCTRL_CRCEN_Pos)             /* (FCR_CRCCTRL) Start CRC Calculation Mask */
#define FCR_CRCCTRL_CRCEN(value)              (FCR_CRCCTRL_CRCEN_Msk & (_UINT32_(value) << FCR_CRCCTRL_CRCEN_Pos)) /* Assigment of value for CRCEN in the FCR_CRCCTRL register */
#define FCR_CRCCTRL_RUNSTDBY_Pos              _UINT32_(5)                                          /* (FCR_CRCCTRL) CRC Run in Standby Position */
#define FCR_CRCCTRL_RUNSTDBY_Msk              (_UINT32_(0x1) << FCR_CRCCTRL_RUNSTDBY_Pos)          /* (FCR_CRCCTRL) CRC Run in Standby Mask */
#define FCR_CRCCTRL_RUNSTDBY(value)           (FCR_CRCCTRL_RUNSTDBY_Msk & (_UINT32_(value) << FCR_CRCCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the FCR_CRCCTRL register */
#define FCR_CRCCTRL_PLEN32_Pos                _UINT32_(12)                                         /* (FCR_CRCCTRL) Polynomial Length Select Position */
#define FCR_CRCCTRL_PLEN32_Msk                (_UINT32_(0x1) << FCR_CRCCTRL_PLEN32_Pos)            /* (FCR_CRCCTRL) Polynomial Length Select Mask */
#define FCR_CRCCTRL_PLEN32(value)             (FCR_CRCCTRL_PLEN32_Msk & (_UINT32_(value) << FCR_CRCCTRL_PLEN32_Pos)) /* Assigment of value for PLEN32 in the FCR_CRCCTRL register */
#define FCR_CRCCTRL_AUTOR_Pos                 _UINT32_(13)                                         /* (FCR_CRCCTRL) CRC Auto Repeat Position */
#define FCR_CRCCTRL_AUTOR_Msk                 (_UINT32_(0x1) << FCR_CRCCTRL_AUTOR_Pos)             /* (FCR_CRCCTRL) CRC Auto Repeat Mask */
#define FCR_CRCCTRL_AUTOR(value)              (FCR_CRCCTRL_AUTOR_Msk & (_UINT32_(value) << FCR_CRCCTRL_AUTOR_Pos)) /* Assigment of value for AUTOR in the FCR_CRCCTRL register */
#define FCR_CRCCTRL_ROUT_Pos                  _UINT32_(14)                                         /* (FCR_CRCCTRL) CRC Reflected Output Position */
#define FCR_CRCCTRL_ROUT_Msk                  (_UINT32_(0x1) << FCR_CRCCTRL_ROUT_Pos)              /* (FCR_CRCCTRL) CRC Reflected Output Mask */
#define FCR_CRCCTRL_ROUT(value)               (FCR_CRCCTRL_ROUT_Msk & (_UINT32_(value) << FCR_CRCCTRL_ROUT_Pos)) /* Assigment of value for ROUT in the FCR_CRCCTRL register */
#define FCR_CRCCTRL_RIN_Pos                   _UINT32_(15)                                         /* (FCR_CRCCTRL) CRC Reflected Input Position */
#define FCR_CRCCTRL_RIN_Msk                   (_UINT32_(0x1) << FCR_CRCCTRL_RIN_Pos)               /* (FCR_CRCCTRL) CRC Reflected Input Mask */
#define FCR_CRCCTRL_RIN(value)                (FCR_CRCCTRL_RIN_Msk & (_UINT32_(value) << FCR_CRCCTRL_RIN_Pos)) /* Assigment of value for RIN in the FCR_CRCCTRL register */
#define FCR_CRCCTRL_PERIOD_Pos                _UINT32_(16)                                         /* (FCR_CRCCTRL) Read Period in GCLK counts Position */
#define FCR_CRCCTRL_PERIOD_Msk                (_UINT32_(0xFFFF) << FCR_CRCCTRL_PERIOD_Pos)         /* (FCR_CRCCTRL) Read Period in GCLK counts Mask */
#define FCR_CRCCTRL_PERIOD(value)             (FCR_CRCCTRL_PERIOD_Msk & (_UINT32_(value) << FCR_CRCCTRL_PERIOD_Pos)) /* Assigment of value for PERIOD in the FCR_CRCCTRL register */
#define FCR_CRCCTRL_Msk                       _UINT32_(0xFFFFF023)                                 /* (FCR_CRCCTRL) Register Mask  */

