Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/fcr.h
#define FCR_CRCCTRL_PLEN_Pos                  _UINT32_(12)                                         /* (FCR_CRCCTRL Position) Polynomial Length Select */
#define FCR_CRCCTRL_PLEN_Msk                  (_UINT32_(0x1) << FCR_CRCCTRL_PLEN_Pos)              /* (FCR_CRCCTRL Mask) PLEN */
#define FCR_CRCCTRL_PLEN(value)               (FCR_CRCCTRL_PLEN_Msk & (_UINT32_(value) << FCR_CRCCTRL_PLEN_Pos)) 

/* -------- FCR_CRCPAUSE : (FCR Offset: 0x24) (R/W 32) CRC PAUSE Register -------- */
#define FCR_CRCPAUSE_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_CRCPAUSE) CRC PAUSE Register  Reset Value */

#define FCR_CRCPAUSE_PAUSE_Pos                _UINT32_(0)                                          /* (FCR_CRCPAUSE) CRC Pause Position */
#define FCR_CRCPAUSE_PAUSE_Msk                (_UINT32_(0x1) << FCR_CRCPAUSE_PAUSE_Pos)            /* (FCR_CRCPAUSE) CRC Pause Mask */
#define FCR_CRCPAUSE_PAUSE(value)             (FCR_CRCPAUSE_PAUSE_Msk & (_UINT32_(value) << FCR_CRCPAUSE_PAUSE_Pos)) /* Assigment of value for PAUSE in the FCR_CRCPAUSE register */
#define FCR_CRCPAUSE_Msk                      _UINT32_(0x00000001)                                 /* (FCR_CRCPAUSE) Register Mask  */


/* -------- FCR_CRCMADR : (FCR Offset: 0x28) (R/W 32) CRC Message Address Register -------- */
#define FCR_CRCMADR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCMADR) CRC Message Address Register  Reset Value */

#define FCR_CRCMADR_CRCMADR_Pos               _UINT32_(0)                                          /* (FCR_CRCMADR) Message Start Address in Flash Position */
#define FCR_CRCMADR_CRCMADR_Msk               (_UINT32_(0xFFFFFFF) << FCR_CRCMADR_CRCMADR_Pos)     /* (FCR_CRCMADR) Message Start Address in Flash Mask */
#define FCR_CRCMADR_CRCMADR(value)            (FCR_CRCMADR_CRCMADR_Msk & (_UINT32_(value) << FCR_CRCMADR_CRCMADR_Pos)) /* Assigment of value for CRCMADR in the FCR_CRCMADR register */
#define FCR_CRCMADR_Msk                       _UINT32_(0x0FFFFFFF)                                 /* (FCR_CRCMADR) Register Mask  */


/* -------- FCR_CRCMLEN : (FCR Offset: 0x2C) (R/W 32) CRC Message Length Register -------- */
#define FCR_CRCMLEN_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCMLEN) CRC Message Length Register  Reset Value */

#define FCR_CRCMLEN_CRCMLEN_Pos               _UINT32_(0)                                          /* (FCR_CRCMLEN) Message Length in Bytes Position */
#define FCR_CRCMLEN_CRCMLEN_Msk               (_UINT32_(0xFFFFFF) << FCR_CRCMLEN_CRCMLEN_Pos)      /* (FCR_CRCMLEN) Message Length in Bytes Mask */
#define FCR_CRCMLEN_CRCMLEN(value)            (FCR_CRCMLEN_CRCMLEN_Msk & (_UINT32_(value) << FCR_CRCMLEN_CRCMLEN_Pos)) /* Assigment of value for CRCMLEN in the FCR_CRCMLEN register */
#define FCR_CRCMLEN_Msk                       _UINT32_(0x00FFFFFF)                                 /* (FCR_CRCMLEN) Register Mask  */


/* -------- FCR_CRCIV : (FCR Offset: 0x30) (R/W 32) CRC Initial Value Register -------- */
#define FCR_CRCIV_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCR_CRCIV) CRC Initial Value Register  Reset Value */

#define FCR_CRCIV_CRCIV_Pos                   _UINT32_(0)                                          /* (FCR_CRCIV) CRC Initial Value Position */
#define FCR_CRCIV_CRCIV_Msk                   (_UINT32_(0xFFFFFFFF) << FCR_CRCIV_CRCIV_Pos)        /* (FCR_CRCIV) CRC Initial Value Mask */
#define FCR_CRCIV_CRCIV(value)                (FCR_CRCIV_CRCIV_Msk & (_UINT32_(value) << FCR_CRCIV_CRCIV_Pos)) /* Assigment of value for CRCIV in the FCR_CRCIV register */
#define FCR_CRCIV_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCIV) Register Mask  */


/* -------- FCR_CRCACC : (FCR Offset: 0x34) ( R/ 32) CRC Accumulator Register -------- */
#define FCR_CRCACC_RESETVALUE                 _UINT32_(0x00)                                       /*  (FCR_CRCACC) CRC Accumulator Register  Reset Value */

#define FCR_CRCACC_CRCACC_Pos                 _UINT32_(0)                                          /* (FCR_CRCACC) CRC Accumulator Result Position */
#define FCR_CRCACC_CRCACC_Msk                 (_UINT32_(0xFFFFFFFF) << FCR_CRCACC_CRCACC_Pos)      /* (FCR_CRCACC) CRC Accumulator Result Mask */
#define FCR_CRCACC_CRCACC(value)              (FCR_CRCACC_CRCACC_Msk & (_UINT32_(value) << FCR_CRCACC_CRCACC_Pos)) /* Assigment of value for CRCACC in the FCR_CRCACC register */
#define FCR_CRCACC_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCACC) Register Mask  */


/* -------- FCR_CRCPOLY : (FCR Offset: 0x38) (R/W 32) CRC Polynomial Register -------- */
#define FCR_CRCPOLY_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCPOLY) CRC Polynomial Register  Reset Value */

#define FCR_CRCPOLY_CRCPOLY_Pos               _UINT32_(0)                                          /* (FCR_CRCPOLY) CRC Polynomial Coefficients for LFSR Position */
#define FCR_CRCPOLY_CRCPOLY_Msk               (_UINT32_(0xFFFFFFFF) << FCR_CRCPOLY_CRCPOLY_Pos)    /* (FCR_CRCPOLY) CRC Polynomial Coefficients for LFSR Mask */
#define FCR_CRCPOLY_CRCPOLY(value)            (FCR_CRCPOLY_CRCPOLY_Msk & (_UINT32_(value) << FCR_CRCPOLY_CRCPOLY_Pos)) /* Assigment of value for CRCPOLY in the FCR_CRCPOLY register */
#define FCR_CRCPOLY_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCPOLY) Register Mask  */


/* -------- FCR_CRCFXOR : (FCR Offset: 0x3C) (R/W 32) CRC Final XOR Register -------- */
#define FCR_CRCFXOR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCFXOR) CRC Final XOR Register  Reset Value */

#define FCR_CRCFXOR_CRCFXOR_Pos               _UINT32_(0)                                          /* (FCR_CRCFXOR) CRC Final XOR Position */
#define FCR_CRCFXOR_CRCFXOR_Msk               (_UINT32_(0xFFFFFFFF) << FCR_CRCFXOR_CRCFXOR_Pos)    /* (FCR_CRCFXOR) CRC Final XOR Mask */
#define FCR_CRCFXOR_CRCFXOR(value)            (FCR_CRCFXOR_CRCFXOR_Msk & (_UINT32_(value) << FCR_CRCFXOR_CRCFXOR_Pos)) /* Assigment of value for CRCFXOR in the FCR_CRCFXOR register */
#define FCR_CRCFXOR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCFXOR) Register Mask  */


/* -------- FCR_CRCSUM : (FCR Offset: 0x40) (R/W 32) CRC Checksum Register -------- */
#define FCR_CRCSUM_RESETVALUE                 _UINT32_(0x00)                                       /*  (FCR_CRCSUM) CRC Checksum Register  Reset Value */

#define FCR_CRCSUM_CRCSUM_Pos                 _UINT32_(0)                                          /* (FCR_CRCSUM) CRC Checksum Position */
#define FCR_CRCSUM_CRCSUM_Msk                 (_UINT32_(0xFFFFFFFF) << FCR_CRCSUM_CRCSUM_Pos)      /* (FCR_CRCSUM) CRC Checksum Mask */
#define FCR_CRCSUM_CRCSUM(value)              (FCR_CRCSUM_CRCSUM_Msk & (_UINT32_(value) << FCR_CRCSUM_CRCSUM_Pos)) /* Assigment of value for CRCSUM in the FCR_CRCSUM register */
#define FCR_CRCSUM_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCSUM) Register Mask  */


/* -------- FCR_FFLTCTRL : (FCR Offset: 0x44) (R/W 32) Flash ECC Fault Control Register -------- */
#define FCR_FFLTCTRL_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_FFLTCTRL) Flash ECC Fault Control Register  Reset Value */

#define FCR_FFLTCTRL_FLTRST_Pos               _UINT32_(0)                                          /* (FCR_FFLTCTRL) Fault Reset Position */
#define FCR_FFLTCTRL_FLTRST_Msk               (_UINT32_(0x1) << FCR_FFLTCTRL_FLTRST_Pos)           /* (FCR_FFLTCTRL) Fault Reset Mask */
#define FCR_FFLTCTRL_FLTRST(value)            (FCR_FFLTCTRL_FLTRST_Msk & (_UINT32_(value) << FCR_FFLTCTRL_FLTRST_Pos)) /* Assigment of value for FLTRST in the FCR_FFLTCTRL register */
#define FCR_FFLTCTRL_FLTEN_Pos                _UINT32_(1)                                          /* (FCR_FFLTCTRL) ECC Fault Enable bit Position */
#define FCR_FFLTCTRL_FLTEN_Msk                (_UINT32_(0x1) << FCR_FFLTCTRL_FLTEN_Pos)            /* (FCR_FFLTCTRL) ECC Fault Enable bit Mask */
#define FCR_FFLTCTRL_FLTEN(value)             (FCR_FFLTCTRL_FLTEN_Msk & (_UINT32_(value) << FCR_FFLTCTRL_FLTEN_Pos)) /* Assigment of value for FLTEN in the FCR_FFLTCTRL register */
#define FCR_FFLTCTRL_CTLFLT_Pos               _UINT32_(8)                                          /* (FCR_FFLTCTRL) ECC/Parity Control Fault bits Position */
#define FCR_FFLTCTRL_CTLFLT_Msk               (_UINT32_(0x7) << FCR_FFLTCTRL_CTLFLT_Pos)           /* (FCR_FFLTCTRL) ECC/Parity Control Fault bits Mask */
#define FCR_FFLTCTRL_CTLFLT(value)            (FCR_FFLTCTRL_CTLFLT_Msk & (_UINT32_(value) << FCR_FFLTCTRL_CTLFLT_Pos)) /* Assigment of value for CTLFLT in the FCR_FFLTCTRL register */
#define FCR_FFLTCTRL_FLTMD_Pos                _UINT32_(12)                                         /* (FCR_FFLTCTRL) Fault Mode Control Position */
#define FCR_FFLTCTRL_FLTMD_Msk                (_UINT32_(0x7) << FCR_FFLTCTRL_FLTMD_Pos)            /* (FCR_FFLTCTRL) Fault Mode Control Mask */
#define FCR_FFLTCTRL_FLTMD(value)             (FCR_FFLTCTRL_FLTMD_Msk & (_UINT32_(value) << FCR_FFLTCTRL_FLTMD_Pos)) /* Assigment of value for FLTMD in the FCR_FFLTCTRL register */
#define FCR_FFLTCTRL_Msk                      _UINT32_(0x00007703)                                 /* (FCR_FFLTCTRL) Register Mask  */


/* -------- FCR_FFLTPTR : (FCR Offset: 0x48) (R/W 32) Flash ECC Fault Pointer Register -------- */
#define FCR_FFLTPTR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTPTR) Flash ECC Fault Pointer Register  Reset Value */

